In [ ]:
import pandas as pd

In [63]:
import pandas as pd
df = pd.read_excel(r"C:\Users\DELL\OneDrive\Documents\data1.xlsx")

In [11]:
df

       city  temp  humidity
0       hyd  23.0       NaN
1       hyd  24.0      46.0
2       hyd  25.0      47.0
3       hyd   NaN      48.0
4      bang  27.0      49.0
5      bang  28.0      50.0
6      bang  29.0       NaN
7      bang   NaN      52.0
8   chennai  31.0      56.0
9   chennai  33.0       NaN
10  chennai   NaN      59.0

In [13]:
df.isnull()

     city   temp  humidity
0   False  False      True
1   False  False     False
2   False  False     False
3   False   True     False
4   False  False     False
5   False  False     False
6   False  False      True
7   False   True     False
8   False  False     False
9   False  False      True
10  False   True     False

In [15]:
df.isnull().sum()

city        0
temp        3
humidity    3
dtype: int64

In [25]:
df_clean = df.dropna()
df_clean

      city  temp  humidity
1      hyd  24.0      46.0
2      hyd  25.0      47.0
4     bang  27.0      49.0
5     bang  28.0      50.0
8  chennai  31.0      56.0

In [27]:
df

       city  temp  humidity
0       hyd  23.0       NaN
1       hyd  24.0      46.0
2       hyd  25.0      47.0
3       hyd   NaN      48.0
4      bang  27.0      49.0
5      bang  28.0      50.0
6      bang  29.0       NaN
7      bang   NaN      52.0
8   chennai  31.0      56.0
9   chennai  33.0       NaN
10  chennai   NaN      59.0

In [43]:
df["temp"]=df["temp"].fillna(df.temp.mean())
df

       city  temp  humidity
0       hyd  23.0      27.5
1       hyd  24.0      46.0
2       hyd  25.0      47.0
3       hyd  27.5      48.0
4      bang  27.0      49.0
5      bang  28.0      50.0
6      bang  29.0      27.5
7      bang  27.5      52.0
8   chennai  31.0      56.0
9   chennai  33.0      27.5
10  chennai  27.5      59.0

In [45]:
df["humidity"]=df["humidity"].fillna(df.temp.mean())
df

       city  temp  humidity
0       hyd  23.0      27.5
1       hyd  24.0      46.0
2       hyd  25.0      47.0
3       hyd  27.5      48.0
4      bang  27.0      49.0
5      bang  28.0      50.0
6      bang  29.0      27.5
7      bang  27.5      52.0
8   chennai  31.0      56.0
9   chennai  33.0      27.5
10  chennai  27.5      59.0

# Reading File(CSV)

In [65]:
import pandas as pd
df = pd.read_csv(r"C:\Users\DELL\Downloads\weather_data.csv")
df

         Date          City  Temperature_C  Humidity_% Condition
0  01-01-2025      Hyderbad             28          60     Sunny
1  02-01-2025    Vijayawada             29          62     Sunny
2  03-01-2025  Viskhapatnam             30          58    Cloudy
3  04-01-2025      Kakinada             31          55    Cloudy
4  05-01-2025      Banglore             32          57     Rainy
5  06-01-2025        Mumbai             33          59     Rainy
6  07-01-2025       Chennai             34          61     Sunny
7  08-01-2025    Rajamundry             32          63    Cloudy
8  09-01-2025         Eluru             31          64     Rainy
9  10-01-2025    Anakapalli             29          62     Sunny

In [89]:
df.head()

         Date          City  Temperature_C  Humidity_% Condition
0  01-01-2025      Hyderbad             28          60     Sunny
1  02-01-2025    Vijayawada             29          62     Sunny
2  03-01-2025  Viskhapatnam             30          58    Cloudy
3  04-01-2025      Kakinada             31          55    Cloudy
4  05-01-2025      Banglore             32          57     Rainy

In [71]:
df.tail()

         Date        City  Temperature_C  Humidity_% Condition
5  06-01-2025      Mumbai             33          59     Rainy
6  07-01-2025     Chennai             34          61     Sunny
7  08-01-2025  Rajamundry             32          63    Cloudy
8  09-01-2025       Eluru             31          64     Rainy
9  10-01-2025  Anakapalli             29          62     Sunny

In [73]:
df[2:5]

         Date          City  Temperature_C  Humidity_% Condition
2  03-01-2025  Viskhapatnam             30          58    Cloudy
3  04-01-2025      Kakinada             31          55    Cloudy
4  05-01-2025      Banglore             32          57     Rainy

In [75]:
df.columns

Index(['Date', 'City', 'Temperature_C', 'Humidity_%', 'Condition'], dtype='object')

In [77]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [79]:
df.dtypes

Date             object
City             object
Temperature_C     int64
Humidity_%        int64
Condition        object
dtype: object

In [81]:
df.Date

0    01-01-2025
1    02-01-2025
2    03-01-2025
3    04-01-2025
4    05-01-2025
5    06-01-2025
6    07-01-2025
7    08-01-2025
8    09-01-2025
9    10-01-2025
Name: Date, dtype: object

In [92]:
df.Temperature_C

0    28
1    29
2    30
3    31
4    32
5    33
6    34
7    32
8    31
9    29
Name: Temperature_C, dtype: int64

In [87]:
df[['Date','Condition']]

         Date Condition
0  01-01-2025     Sunny
1  02-01-2025     Sunny
2  03-01-2025    Cloudy
3  04-01-2025    Cloudy
4  05-01-2025     Rainy
5  06-01-2025     Rainy
6  07-01-2025     Sunny
7  08-01-2025    Cloudy
8  09-01-2025     Rainy
9  10-01-2025     Sunny

In [94]:
df = pd.DataFrame({
    "name" : ["siri","sri","mouni","anu"],
    "age":[20,22,19,20]
})
df

    name  age
0   siri   20
1    sri   22
2  mouni   19
3    anu   20